
+ M2 --no-readline --print-width 67
Macaulay2, version 1.16
--loading configuration for package "FourTiTwo" from file /home/cingalls/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/cingalls/.Macaulay2/init-Topcom.m2
with packages: ConwayPolynomials, Elimination, IntegralClosure,
               InverseSystems, LLLBases, MinimalPrimes,
               PrimaryDecomposition, ReesAlgebra, TangentCone,
               Truncations

i1 : KK=ZZ/31991

o1 = KK

o1 : QuotientRing

i2 : n=4

o2 = 4

i3 : R=KK[x_1..x_n]

o3 = R

o3 : PolynomialRing

i4 : 
     idealList1 = 
     {ideal(x_1^2-7*x_2^2,x_1*x_2-3*x_2^2,x_3^2,x_4^2),
     ideal(x_1^2,x_1*random(1,R)+x_2*random(1,R),random(2,R),random(2,R)),
     ideal(x_1^2,x_2^2,x_3^2,random(2,R)),
     ideal((x_1+x_2+x_3+x_4)^2,x_1^2,x_2^2,x_3*x_4),
     ideal(x_1^2,x_1*random(1,R)+x_2*random(1,R),random(2,R),random(2,R)),
     ideal(x_1^2,x_2^2,x_3^2,random(2,R)),
     ideal((x_1+x_2+x_3+x_4)^2,x_1^2,x_2^2,x_3*x_4),
     ideal(x_1^2+(random(0,R))*x_3*x_4+x_4^2,x_2^2+random(0,R)*x_3*x_4+x_4^2,x_1*x_2*random(0,R)*x_3*x_4+x_4^2,x_3^2+random(0,R)*x_3*x_4+x_4^2)}

              2     2           2   2   2           2          2  
o4 = {ideal (x  - 7x , x x  - 3x , x , x ), ideal (x , - 12132x  -
              1     2   1 2     2   3   4           1          1  
     --------------------------------------------------------------
                      2                                            
     1479x x  - 10036x  + 87x x  - 12999x x  - 4989x x  - 3452x x ,
          1 2         2      1 3         2 3        1 4        2 4 
     --------------------------------------------------------------
           2                   2                              2  
     - 512x  + 7221x x  + 8770x  - 8365x x  + 1064x x  - 9170x  -
           1        1 2        2        1 3        2 3        3  
     --------------------------------------------------------------
                                              2         2  
     11518x x  - 3876x x  - 13225x x  + 10825x , - 2006x  -
           1 4        2 4         3 4         4         1  
     --------------------------------------------------------------
                       2                                2  
     11450x x  - 12290x  + 11140x x  + 4847x x  + 12625x  -
           1 2         2         1 3        2 3         3  
     --------------------------------------------------------------
                                             2           2   2   2 
     10128x x  + 7439x x  + 2179x x  + 12333x ), ideal (x , x , x ,
           1 4        2 4        3 4         4           1   2   3 
     --------------------------------------------------------------
           2                  2                              2  
     10608x  + 8103x x  + 976x  - 5040x x  - 4206x x  - 9585x  -
           1        1 2       2        1 3        2 3        3  
     --------------------------------------------------------------
                                           2           2          
     455x x  - 14139x x  + 2977x x  + 2936x ), ideal (x  + 2x x  +
         1 4         2 4        3 4        4           1     1 2  
     --------------------------------------------------------------
      2                    2                            2   2   2 
     x  + 2x x  + 2x x  + x  + 2x x  + 2x x  + 2x x  + x , x , x ,
      2     1 3     2 3    3     1 4     2 4     3 4    4   1   2 
     --------------------------------------------------------------
                    2       2                    2             
     x x ), ideal (x , 1179x  - 11275x x  + 9729x  - 7177x x  -
      3 4           1       1         1 2        2        1 3  
     --------------------------------------------------------------
                                               2             
     8859x x  - 13714x x  + 15120x x , - 11543x  + 4962x x  -
          2 3         1 4         2 4          1        1 2  
     --------------------------------------------------------------
          2                             2                        
     1897x  + 2259x x  - 928x x  - 4390x  - 4898x x  + 4785x x  +
          2        1 3       2 3        3        1 4        2 4  
     --------------------------------------------------------------
                       2       2                   2              
     11686x x  + 13131x , 8523x  - 6163x x  + 4563x  - 12581x x  +
           3 4         4       1        1 2        2         1 3  
     --------------------------------------------------------------
                     2                                     
     6980x x  - 9522x  - 14993x x  + 1052x x  + 13644x x  -
          2 3        3         1 4        2 4         3 4  
     --------------------------------------------------------------
          2           2   2   2          2                   2  
     5780x ), ideal (x , x , x , - 12715x  - 2820x x  + 1117x  +
          4           1   2   3          1        1 2        2  
     --------------------------------------------------------------
                                  2                         
     12096x x  - 6370x x  + 14159x  - 8037x x  + 15318x x  -
           1 3        2 3         3        1 4         2 4  
     --------------------------------------------------------------
                     2           2            2                  
     7977x x  + 1940x ), ideal (x  + 2x x  + x  + 2x x  + 2x x  +
          3 4        4           1     1 2    2     1 3     2 3  
     --------------------------------------------------------------
      2                            2   2   2                 2  
     x  + 2x x  + 2x x  + 2x x  + x , x , x , x x ), ideal (x  -
      3     1 4     2 4     3 4    4   1   2   3 4           1  
     --------------------------------------------------------------
                 2   2               2                  2   2  
     1607x x  + x , x  + 6274x x  + x , 8904x x x x  + x , x  -
          3 4    4   2        3 4    4       1 2 3 4    4   3  
     --------------------------------------------------------------
                 2
     4657x x  + x )}
          3 4    4

o4 : List

i5 : 
     a1=random(0,R)

o5 = 1514

o5 : R

i6 : a2=random(0,R)

o6 = -2238

o6 : R

i7 : a3=random(0,R)

o7 = -12474

o7 : R

i8 : a4=random(0,R)

o8 = -2738

o8 : R

i9 : idealList2 = {
     ideal(x_1^2+x_2^2+x_3^2+2*x_1*x_2+2*x_1*x_3+2*x_2*x_3+a4*x_4^2,
         x_1^2+a1*x_4^2,x_2^2+a2*x_4^2,x_3^2+a3*x_4^2),
     ideal(2*x_1*x_2+2*x_1*x_3+2*x_2*x_3+a4*x_4^2,
         x_1^2+a1*x_4^2,
         x_2^2+a2*x_4^2,
         x_3^2+a3*x_4^2),
     ideal(2*x_1*x_2-2*x_1*x_3+a4*x_4^2,
         x_1^2+a1*x_4^2,
         x_2^2+a2*x_4^2,
         x_3^2+a3*x_4^2),
     ideal(2*x_2*x_3+a4*x_4^2,
         x_1^2+a1*x_4^2,
         x_2^2+a2*x_4^2,
         2*x_1*x_2-x_3^2+a3*x_4^2),
     ideal(2*x_1*x_2+a4*x_4^2,
         x_1^2+a1*x_4^2,
         x_2^2+a2*x_4^2,
         x_3^2+a3*x_4^2)}

              2            2                    2        2   2  
o9 = {ideal (x  + 2x x  + x  + 2x x  + 2x x  + x  - 2738x , x  +
              1     1 2    2     1 3     2 3    3        4   1  
     --------------------------------------------------------------
          2   2        2   2         2                         
     1514x , x  - 2238x , x  - 12474x ), ideal (2x x  + 2x x  +
          4   2        4   3         4            1 2     1 3  
     --------------------------------------------------------------
                  2   2        2   2        2   2         2        
     2x x  - 2738x , x  + 1514x , x  - 2238x , x  - 12474x ), ideal
       2 3        4   1        4   2        4   3         4        
     --------------------------------------------------------------
                           2   2        2   2        2   2  
     (2x x  - 2x x  - 2738x , x  + 1514x , x  - 2238x , x  -
        1 2     1 3        4   1        4   2        4   3  
     --------------------------------------------------------------
           2                       2   2        2   2        2 
     12474x ), ideal (2x x  - 2738x , x  + 1514x , x  - 2238x ,
           4            2 3        4   1        4   2        4 
     --------------------------------------------------------------
              2         2                       2   2        2   2
     2x x  - x  - 12474x ), ideal (2x x  - 2738x , x  + 1514x , x 
       1 2    3         4            1 2        4   1        4   2
     --------------------------------------------------------------
            2   2         2
     - 2238x , x  - 12474x )}
            4   3         4

o9 : List

i10 : 
      idealList3 = {
      ideal(x_1^2,x_1*random(1,R)+x_2*random(1,R),random(2,R),random(2,R)),
      ideal(x_1^2,x_2^2,x_3^2,random(2,R)),
      ideal((x_1+x_2+x_3+x_4)^2,x_1^2,x_2^2,x_3*x_4),
      ideal(random(2,R),random(2,R), random(2,R),random(2,R)),
      ideal(x_1^2+(random(0,R))*x_3*x_4+x_4^2,x_2^2+random(0,R)*x_3*x_4+x_4^2,x_1*x_2+random(0,R)*x_3*x_4+x_4^2,x_3^2+random(0,R)*x_3*x_4+x_4^2)}

               2        2                     2             
o10 = {ideal (x , 12463x  + 11964x x  + 15262x  + 4558x x  +
               1        1         1 2         2        1 3  
      -------------------------------------------------------------
                                             2                    2
      10794x x  - 12362x x  - 8918x x , 5454x  + 2463x x  - 11894x 
            2 3         1 4        2 4       1        1 2         2
      -------------------------------------------------------------
                                    2                         
      + 9220x x  - 3909x x  - 10756x  + 4068x x  - 14504x x  +
             1 3        2 3         3        1 4         2 4  
      -------------------------------------------------------------
                       2          2                   2            
      10038x x  + 7629x , - 11472x  - 8081x x  - 5319x  - 330x x  -
            3 4        4          1        1 2        2       1 3  
      -------------------------------------------------------------
                       2                                   
      8960x x  + 14662x  + 7644x x  - 2205x x  - 4337x x  +
           2 3         3        1 4        2 4        3 4  
      -------------------------------------------------------------
            2           2   2   2        2                   2  
      11098x ), ideal (x , x , x , 13347x  - 14720x x  + 141x  +
            4           1   2   3        1         1 2       2  
      -------------------------------------------------------------
                                 2                                 
      5311x x  - 1905x x  - 8661x  + 1144x x  - 15170x x  + 793x x 
           1 3        2 3        3        1 4         2 4       3 4
      -------------------------------------------------------------
             2           2            2                    2  
      - 1958x ), ideal (x  + 2x x  + x  + 2x x  + 2x x  + x  +
             4           1     1 2    2     1 3     2 3    3  
      -------------------------------------------------------------
                               2   2   2                      2  
      2x x  + 2x x  + 2x x  + x , x , x , x x ), ideal (12705x  +
        1 4     2 4     3 4    4   1   2   3 4                1  
      -------------------------------------------------------------
                       2                               2           
      5839x x  + 15918x  + 3472x x  + 4531x x  + 11283x  - 8336x x 
           1 2         2        1 3        2 3         3        1 4
      -------------------------------------------------------------
                                   2          2             
      + 6914x x  - 5058x x  - 2113x , - 14974x  - 3740x x  +
             2 4        3 4        4          1        1 2  
      -------------------------------------------------------------
            2                              2                       
      13528x  + 7025x x  + 9981x x  + 7595x  - 9848x x  + 12623x x 
            2        1 3        2 3        3        1 4         2 4
      -------------------------------------------------------------
                          2         2                    2  
      + 15513x x  - 14705x , - 7210x  + 6816x x  - 11488x  +
              3 4         4         1        1 2         2  
      -------------------------------------------------------------
                                 2                                 
      11034x x  - 394x x  + 5749x  + 6924x x  - 970x x  - 406x x  +
            1 3       2 3        3        1 4       2 4       3 4  
      -------------------------------------------------------------
            2        2                     2                       
      11580x , 13013x  + 12045x x  + 10575x  - 8352x x  + 14173x x 
            4        1         1 2         2        1 3         2 3
      -------------------------------------------------------------
              2                                          2        
      - 15690x  - 13556x x  - 8153x x  - 3709x x  - 2123x ), ideal
              3         1 4        2 4        3 4        4        
      -------------------------------------------------------------
        2               2   2                2                   
      (x  - 8297x x  + x , x  - 14664x x  + x , x x  - 1974x x  +
        1        3 4    4   2         3 4    4   1 2        3 4  
      -------------------------------------------------------------
       2   2                2
      x , x  - 10546x x  + x )}
       4   3         3 4    4

o10 : List

i11 : 
      hoch = I->(
      RI=R/I;
      use RI;
      S=tensor(RI,RI,Variables =>{x_1..x_4,y_1..y_4},Degrees=>{1,1,1,1,1,1,1,1});
      Idelta=ideal(x_1-y_1,x_2-y_2,x_3-y_3,x_4-y_4);
      delta=S^1/Idelta;
      apply({1,2},i->(numerator reduceHilbert hilbertSeries(Ext^i(delta,delta)))))

o11 = hoch

o11 : FunctionClosure

i12 : 
      apply(idealList1,hoch)

                     2     3    -2      -1                2       
o12 = {{4 + 12T + 12T  + 4T , 4T   + 12T   + 18 + 16T + 6T }, {1 +
      -------------------------------------------------------------
              2     3    -2      -1               2             
      9T + 12T  + 4T , 4T   + 12T   + 9 + 10T + 6T }, {1 + 11T +
      -------------------------------------------------------------
         2     3    -2      -1                2                 2  
      12T  + 4T , 4T   + 12T   + 10 + 14T + 6T }, {1 + 11T + 12T  +
      -------------------------------------------------------------
        3    -2      -1                2                2     3 
      4T , 4T   + 12T   + 10 + 14T + 6T }, {1 + 9T + 12T  + 4T ,
      -------------------------------------------------------------
        -2      -1               2                 2     3    -2  
      4T   + 12T   + 9 + 10T + 6T }, {1 + 11T + 12T  + 4T , 4T   +
      -------------------------------------------------------------
         -1                2                 2     3    -2      -1
      12T   + 10 + 14T + 6T }, {1 + 11T + 12T  + 4T , 4T   + 12T  
      -------------------------------------------------------------
                     2                2     3               2  
      + 10 + 14T + 6T }, {4 + 9T + 11T  + 4T , 9 + 25T + 11T  +
      -------------------------------------------------------------
        3
      2T }}

o12 : List

i13 : apply(idealList2,hoch)

                    2     3    -2      -1                2       
o13 = {{1 + 9T + 12T  + 4T , 4T   + 12T   + 10 + 10T + 6T }, {1 +
      -------------------------------------------------------------
              2     3    -2      -1                2            
      9T + 12T  + 4T , 4T   + 12T   + 10 + 10T + 6T }, {1 + 9T +
      -------------------------------------------------------------
         2     3    -2      -1                2                2  
      12T  + 4T , 4T   + 12T   + 10 + 10T + 6T }, {1 + 9T + 12T  +
      -------------------------------------------------------------
        3    -2      -1                2                 2     3 
      4T , 4T   + 12T   + 10 + 10T + 6T }, {2 + 10T + 12T  + 4T ,
      -------------------------------------------------------------
        -2      -1                2
      4T   + 12T   + 13 + 12T + 6T }}

o13 : List

i14 : apply(idealList3,hoch)

                    2     3    -2      -1               2       
o14 = {{1 + 9T + 12T  + 4T , 4T   + 12T   + 9 + 10T + 6T }, {1 +
      -------------------------------------------------------------
               2     3    -2      -1                2             
      11T + 12T  + 4T , 4T   + 12T   + 10 + 14T + 6T }, {1 + 11T +
      -------------------------------------------------------------
         2     3    -2      -1                2                2  
      12T  + 4T , 4T   + 12T   + 10 + 14T + 6T }, {1 + 8T + 12T  +
      -------------------------------------------------------------
        3    -2      -1              2                2     3    -2
      4T , 4T   + 12T   + 9 + 8T + 6T }, {1 + 8T + 12T  + 4T , 4T  
      -------------------------------------------------------------
           -1               2
      + 12T   + 10 + 8T + 6T }}

o14 : List

i15 : 